peterkappelt/kHome/software/cc1310/template_tempSens_HW1_tirtos_ccs/tempSens_HWV1.c
/**
 * Copyright 2017, Peter Kappelt
 * Adjusted this file, which is originally from the CC1310-LaunchXL-Board, for the kHome temperatureSensor board, Hardware V1
 */

/**
 * Version History:
 * • V1.1 (20.4.2017)
 *  - added this version history
 * • V1.0 (19.4.2017)
 *  - initial revision
 */

/*
 * Copyright (c) 2015-2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ====================== tempSens_HWV1.c ===================================
 *  This file is responsible for setting up the board specific items for the
 *  tempSens_HWV1 board.
 */

#include <tempSens_HWV1.h>
#include <xdc/std.h>
#include <xdc/runtime/System.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

#include <ti/devices/cc13x0/driverlib/ioc.h>
#include <ti/devices/cc13x0/driverlib/udma.h>
#include <ti/devices/cc13x0/inc/hw_ints.h>
#include <ti/devices/cc13x0/inc/hw_memmap.h>

#include <ti/drivers/ADCBuf.h>
#include <ti/drivers/adcbuf/ADCBufCC26XX.h>

ADCBufCC26XX_Object adcBufCC26xxObjects[tempSens_HWV1_ADCBUFCOUNT];

/*
 *  This table converts a virtual adc channel into a dio and internal analogue
 *  input signal. This table is necessary for the functioning of the adcBuf
 *  driver. Comment out unused entries to save flash. Dio and internal signal
 *  pairs are hardwired. Do not remap them in the table. You may reorder entire
 *  entries. The mapping of dio and internal signals is package dependent.
 */
const ADCBufCC26XX_AdcChannelLutEntry ADCBufCC26XX_adcChannelLut[tempSens_HWV1_ADCBUF0CHANNELCOUNT] = {
    {tempSens_HWV1_DIO23_ANALOG, ADC_COMPB_IN_AUXIO7},
    {tempSens_HWV1_DIO24_ANALOG, ADC_COMPB_IN_AUXIO6},
    {tempSens_HWV1_DIO25_ANALOG, ADC_COMPB_IN_AUXIO5},
    {tempSens_HWV1_DIO26_ANALOG, ADC_COMPB_IN_AUXIO4},
    {tempSens_HWV1_DIO27_ANALOG, ADC_COMPB_IN_AUXIO3},
    {tempSens_HWV1_DIO28_ANALOG, ADC_COMPB_IN_AUXIO2},
    {tempSens_HWV1_DIO29_ANALOG, ADC_COMPB_IN_AUXIO1},
    {tempSens_HWV1_DIO30_ANALOG, ADC_COMPB_IN_AUXIO0},
    {PIN_UNASSIGNED, ADC_COMPB_IN_VDDS},
    {PIN_UNASSIGNED, ADC_COMPB_IN_DCOUPL},
    {PIN_UNASSIGNED, ADC_COMPB_IN_VSS},
};

const ADCBufCC26XX_HWAttrs adcBufCC26xxHWAttrs[tempSens_HWV1_ADCBUFCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .adcChannelLut     = ADCBufCC26XX_adcChannelLut,
        .gpTimerUnit       = tempSens_HWV1_GPTIMER0A,
        .gptDMAChannelMask = 1 << UDMA_CHAN_TIMER0_A,
    }
};

const ADCBuf_Config ADCBuf_config[tempSens_HWV1_ADCBUFCOUNT] = {
    {
        &ADCBufCC26XX_fxnTable,
        &adcBufCC26xxObjects[tempSens_HWV1_ADCBUF0],
        &adcBufCC26xxHWAttrs[tempSens_HWV1_ADCBUF0]
    },
};

const uint_least8_t ADCBuf_count = tempSens_HWV1_ADCBUFCOUNT;

/*
 *  =============================== ADC ===============================
 */
#include <ti/drivers/ADC.h>
#include <ti/drivers/adc/ADCCC26XX.h>

ADCCC26XX_Object adcCC26xxObjects[tempSens_HWV1_ADCCOUNT];


const ADCCC26XX_HWAttrs adcCC26xxHWAttrs[tempSens_HWV1_ADCCOUNT] = {
    {
        .adcDIO              = tempSens_HWV1_DIO23_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO7,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO24_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO6,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO25_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO5,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO26_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO4,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO27_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO3,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO28_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO2,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO29_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO1,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = tempSens_HWV1_DIO30_ANALOG,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO0,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_10P9_MS,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_DCOUPL,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_VSS,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_VDDS,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = 0
    }
};

const ADC_Config ADC_config[tempSens_HWV1_ADCCOUNT] = {
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC0], &adcCC26xxHWAttrs[tempSens_HWV1_ADC0]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC1], &adcCC26xxHWAttrs[tempSens_HWV1_ADC1]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC2], &adcCC26xxHWAttrs[tempSens_HWV1_ADC2]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC3], &adcCC26xxHWAttrs[tempSens_HWV1_ADC3]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC4], &adcCC26xxHWAttrs[tempSens_HWV1_ADC4]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC5], &adcCC26xxHWAttrs[tempSens_HWV1_ADC5]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC6], &adcCC26xxHWAttrs[tempSens_HWV1_ADC6]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADC7], &adcCC26xxHWAttrs[tempSens_HWV1_ADC7]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADCDCOUPL], &adcCC26xxHWAttrs[tempSens_HWV1_ADCDCOUPL]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADCVSS], &adcCC26xxHWAttrs[tempSens_HWV1_ADCVSS]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[tempSens_HWV1_ADCVDDS], &adcCC26xxHWAttrs[tempSens_HWV1_ADCVDDS]},
};

const uint_least8_t ADC_count = tempSens_HWV1_ADCCOUNT;

