peterkappelt/kHome/software/cc1310/template_tempSens_HW1_tirtos_ccs/tempSens_HWV1.c
/*
 *  =============================== I2C ===============================
*/
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC26XX.h>

I2CCC26XX_Object i2cCC26xxObjects[tempSens_HWV1_I2CCOUNT];

const I2CCC26XX_HWAttrsV1 i2cCC26xxHWAttrs[tempSens_HWV1_I2CCOUNT] = {
    {
        .baseAddr    = I2C0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_I2C0,
        .intNum      = INT_I2C_IRQ,
        .intPriority = ~0,
        .swiPriority = 0,
        .sdaPin      = tempSens_HWV1_I2C0_SDA0,
        .sclPin      = tempSens_HWV1_I2C0_SCL0,
    }
};

const I2C_Config I2C_config[tempSens_HWV1_I2CCOUNT] = {
    {
        .fxnTablePtr = &I2CCC26XX_fxnTable,
        .object      = &i2cCC26xxObjects[tempSens_HWV1_I2C0],
        .hwAttrs     = &i2cCC26xxHWAttrs[tempSens_HWV1_I2C0]
    }
};

const uint_least8_t I2C_count = tempSens_HWV1_I2CCOUNT;

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {

    tempSens_HWV1_PIN_PRGLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,       /* LED initially off          */
    /*tempSens_HWV1_PIN_GLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,*/       /* LED initially off          */
    tempSens_HWV1_PIN_PRGBTN | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,          /* Button is active low       */
    /*tempSens_HWV1_PIN_BTN2 | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,*/        /* Button is active low       */
    /*tempSens_HWV1_SPI_FLASH_CS | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MIN, */ /* External flash chip select */
    tempSens_HWV1_UART_RX | PIN_INPUT_EN | PIN_PULLDOWN,                                              /* UART RX via debugger back channel */
    tempSens_HWV1_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    tempSens_HWV1_SPI0_MOSI | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master out - slave in */
    tempSens_HWV1_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master in - slave out */
    tempSens_HWV1_SPI0_CLK | PIN_INPUT_EN | PIN_PULLDOWN,                                             /* SPI clock */

    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = TRUE,
    .calibrateRCOSC_LF  = TRUE,
    .calibrateRCOSC_HF  = TRUE,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[tempSens_HWV1_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWMCOUNT] = {
    { .pwmPin = tempSens_HWV1_PWMPIN0, .gpTimerUnit = tempSens_HWV1_GPTIMER0A },
    { .pwmPin = tempSens_HWV1_PWMPIN1, .gpTimerUnit = tempSens_HWV1_GPTIMER0B },
    { .pwmPin = tempSens_HWV1_PWMPIN2, .gpTimerUnit = tempSens_HWV1_GPTIMER1A },
    { .pwmPin = tempSens_HWV1_PWMPIN3, .gpTimerUnit = tempSens_HWV1_GPTIMER1B },
    { .pwmPin = tempSens_HWV1_PWMPIN4, .gpTimerUnit = tempSens_HWV1_GPTIMER2A },
    { .pwmPin = tempSens_HWV1_PWMPIN5, .gpTimerUnit = tempSens_HWV1_GPTIMER2B },
    { .pwmPin = tempSens_HWV1_PWMPIN6, .gpTimerUnit = tempSens_HWV1_GPTIMER3A },
    { .pwmPin = tempSens_HWV1_PWMPIN7, .gpTimerUnit = tempSens_HWV1_GPTIMER3B },
};

const PWM_Config PWM_config[tempSens_HWV1_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM0], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM1], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM2], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM3], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM4], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM5], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM6], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[tempSens_HWV1_PWM7], &pwmtimerCC26xxHWAttrs[tempSens_HWV1_PWM7] },
};

const uint_least8_t PWM_count = tempSens_HWV1_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrs RFCC26XX_hwAttrs = {
    .hwiCpe0Priority = ~0,
    .hwiHwPriority   = ~0,
    .swiCpe0Priority =  0,
    .swiHwPriority   =  0,
};

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[tempSens_HWV1_SPICOUNT];

const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[tempSens_HWV1_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = tempSens_HWV1_SPI0_MOSI,
        .misoPin            = tempSens_HWV1_SPI0_MISO,
        .clkPin             = tempSens_HWV1_SPI0_CLK,
        .csnPin             = tempSens_HWV1_SPI0_CSN
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = tempSens_HWV1_SPI1_MOSI,
        .misoPin            = tempSens_HWV1_SPI1_MISO,
        .clkPin             = tempSens_HWV1_SPI1_CLK,
        .csnPin             = tempSens_HWV1_SPI1_CSN
    }
};

const SPI_Config SPI_config[tempSens_HWV1_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[tempSens_HWV1_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[tempSens_HWV1_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[tempSens_HWV1_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[tempSens_HWV1_SPI1]
    },
};

const uint_least8_t SPI_count = tempSens_HWV1_SPICOUNT;

