peterkappelt/kHome/software/cc1310/template_tempSens_HW1_tirtos_ccs/tempSens_HWV1.c
/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

UARTCC26XX_Object uartCC26XXObjects[tempSens_HWV1_UARTCOUNT];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[tempSens_HWV1_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = tempSens_HWV1_UART_TX,
        .rxPin          = tempSens_HWV1_UART_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED
    }
};

const UART_Config UART_config[tempSens_HWV1_UARTCOUNT] = {
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[tempSens_HWV1_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[tempSens_HWV1_UART0]
    },
};

const uint_least8_t UART_count = tempSens_HWV1_UARTCOUNT;

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[tempSens_HWV1_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[tempSens_HWV1_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[tempSens_HWV1_UDMACOUNT] = {
    {
         .object  = &udmaObjects[tempSens_HWV1_UDMA0],
         .hwAttrs = &udmaHWAttrs[tempSens_HWV1_UDMA0]
    },
};

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[tempSens_HWV1_WATCHDOGCOUNT];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[tempSens_HWV1_WATCHDOGCOUNT] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[tempSens_HWV1_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[tempSens_HWV1_WATCHDOG0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[tempSens_HWV1_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = tempSens_HWV1_WATCHDOGCOUNT;

/*
 *  ======== tempSens_HWV1_initGeneral ========
 */
void tempSens_HWV1_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        System_abort("Error with PIN_init\n");
    }
}
